quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMPLCDV12.C
#ifdef AMPLCDV12

#include "AMPLCDV12.H"

#include	"AMP_Protocol.H"

//#include	"AMP_PHY.H"
//#include "AMP_LAY.H"
//#include "AMP_CABV11.H"

#include "STM32_SYS.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_TIM.H"
#include "STM32_FLASH.H"

#include "LCD.H"
#include "ST7789V.H"
#include "GT32L32M0180.H"

#include "font.h"



/* Private variables ---------------------------------------------------------*/
sAmpLcdDef	sAmpLcd;



//unsigned	short FlashTime	=0;
unsigned	char	DaulFlag	=	0;
/* Private function prototypes -----------------------------------------------*/
static void HW_Configuration(void);
static void DataInitialize(void);		//数据初始化

static void DisplayString(void);
static void DisplayGui(void);				//显示界面
static void DisplayName(const ListDef Node);				//显示别名和名称
static void DisplayByName(const ListDef Node);			//显示别名
static void DisplayVender(const ListDef Node);			//显示厂家名称
static void DisplaySpec(const ListDef Node);				//显示规格
static void DisplayCode(const ListDef Node);				//显示编码
static void DisplayNumber(const ListDef Node);			//显示数量和单位
static void DisplayTitle(unsigned char DualFlag);			//显示标题
static unsigned short GetYVLen(const ListDef Node);//获取节点数据占用Y轴的点数

static void GetManaData(const unsigned char* Databuffer,unsigned short datalen);
static void SetManaData(ListDef* pNode);		//设置显示参数---数据获取成功后设置相关的显示参数

static void ReceiveData(void);
static void SendData(void);
static void AckData(void);
static void ProcessData(unsigned char* ReceDatabuffer,unsigned short datalen);

static void Lcd_Process(void);
static void AddressNoneProcess(void);
static void NoDataProcess(void);
static void Read_switchid(void);
static void SYSLED(void);
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV12_Configuration(void)
{	
	
	SYS_Configuration();				//系统配置
	
  
  
//  PWM_OUT(TIM2,PWM_OUTChannel1,2,500);	//PWM设定-20161127版本	占空比1/1000
	
	//SysTick_DeleymS(500);				//SysTick延时nmS
	
  HW_Configuration(); 

	DataInitialize();	
  
	GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_0);
	
  IWDG_Configuration(2000);													//独立看门狗配置---参数单位ms
	
	//SetBackColor(LCD565_DARKBLUE);
  ST7789V_Clean(0xFFFF);
	ST7789V_Clean(LCD565_DARKBLUE);
	//AMPLCDV11GUI();
  SysTick_Configuration(1000);    //系统嘀嗒时钟配置72MHz,单位为uS  
  while(1)
  {
		ReceiveData();
		SendData();
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV12_Server(void)
{  
	IWDG_Feed();								//独立看门狗喂狗
  SYSLED();
	AddressNoneProcess();
	Lcd_Process();
	Read_switchid();
	NoDataProcess();	 
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SYSLED(void)
{
	static unsigned short time=0;
	if(time++>100)
	{
		time=	0;
		GPIO_Toggle	(GPIOA,GPIO_Pin_0);		//将GPIO相应管脚输出翻转----V20170605
	}
	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lcd_Process(void)
{
	static unsigned short time=0;
	static unsigned char	Type_Count_bac=0;
//	static unsigned char color=0;
	unsigned char i=0;
	unsigned char dataflag=0;
	ListDef*		List;
	
	List	=	sAmpLcd.Windows.ManaData.List;
	if(0==sAmpLcd.Sys.AddrLay||0==sAmpLcd.Sys.AddrSeg)
	{
		return;
	}
	for(i=0;i<DspMaxNameTypeCount;i++)
	{
		if(0!=List[i].ListNum)
		{
			dataflag	=	1;
			break;
		}
	}
	if(Type_Count_bac!=sAmpLcd.Windows.ManaData.ReceivedManaCount)
	{
		time	=	0;
		sAmpLcd.Windows.ManaData.Serial	=	0;
		Type_Count_bac=sAmpLcd.Windows.ManaData.ReceivedManaCount;
	}
	
	if(0==dataflag)
		return;
	if(time==0)
  {
//		if(sAmpLcd.Windows.ManaData.ReceivedManaCount==0)
//		{
//			DisplayGui();				//显示界面
//			DisplayTitle(0);			//显示标题
//			goto FlashTimeCon;
//		}
		if(sAmpLcd.Windows.ManaData.ReceivedManaCount<=2)
		{
			if((sAmpLcd.Windows.ManaData.Serial==DaulFlag)&&(sAmpLcd.Windows.ManaData.Serial==sAmpLcd.Windows.ManaData.ReceivedManaCount))
			goto FlashTimeCon;
		}
			DisplayString();
  }
	FlashTimeCon:
	if(time++>3000)
		time=0; 
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Read_switchid(void)
{
	static unsigned short time=0;
	if(time++>1000)
	{
		unsigned char temp	=	0;
		time	=	0;
		temp	=	api_get_SwitchId_data_left(&sAmpLcd.sSwitch);
		sAmpLcd.Sys.AddrLay=(temp>>4)&0X0F;  	//层地址
		sAmpLcd.Sys.AddrSeg=temp&0x0F;      	//位地址
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void AddressNoneProcess(void)
{
	static unsigned short time=0;
	static unsigned char flag=0;
	unsigned short color	=	0;
	if(0==sAmpLcd.Sys.AddrLay||0==sAmpLcd.Sys.AddrSeg)
	{
		if(time++>1000)
		{
			time	=	0;
			flag+=1;
			if(flag++>5)
			{
				flag=0;
			}
			if(0==flag)
			{
				color	=	LCD565_GBLUE;
			}
			else if(1==flag)
			{
				color	=	LCD565_GRAY;
			}
			else if(2==flag)
			{
				color	=	LCD565_RED;
			}
			else if(3==flag)
			{
				color	=	LCD565_LIGHTGREEN;
			}
			else if(4==flag)
			{
				color	=	LCD565_GBLUE;
			}
			else
			{
				color	=	LCD565_WHITE;
			}
			ST7789V_Clean(color);	//清除屏幕函数;
			ST7789V_Printf(5,100,32,color^0xFF,"未拨码");				//后边的省略号就是可变参数
			ST7789V_BL_ON;
		}
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void NoDataProcess(void)
{
	static unsigned short time=0;
	static unsigned char flag=0;
	static unsigned char power_up_flag=0;
	unsigned short color	=	0;
	
	unsigned char i=0;
	unsigned char dataflag=0;
	ListDef*		List;
	
	List	=	sAmpLcd.Windows.ManaData.List;
	
	if(time++<100)
	{
		return;
	}
	time	=	0;
	if((0!=sAmpLcd.Sys.AddrLay)&&(0!=sAmpLcd.Sys.AddrSeg))
	{
		for(i=0;i<DspMaxNameTypeCount;i++)
		{
			if(0!=List[i].ListNum)
			{
				dataflag	=	1;
				break;
			}
		}
		if(0!=dataflag)
		{
			dataflag	=	0;
			ST7789V_BL_ON;
			return;
		}
		else
		{
//			if(0==power_up_flag)
//			{
//				power_up_flag	=	1;
//				ST7789V_Clean(LCD565_BLACK);	//清除屏幕函数;
//				ST7789V_Printf(5,100,32,LCD565_LIGHTGREEN,"层号:%0.2d  位号:%0.2d",sAmpLcd.Sys.AddrLay,sAmpLcd.Sys.AddrSeg);				//后边的省略号就是可变参数
//				ST7789V_BL_ON;
//			}
//			else if(power_up_flag<50)
//			{
//				power_up_flag+=1;
//			}
//			else
//			{
//				ST7789V_BL_OFF;
//			}
			ST7789V_BL_OFF;
		}		
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayString(void)
{
	unsigned char i	=	0;
	unsigned char Serial	=	0;	
	unsigned char MaxNameList=0;
	unsigned short StartPixelY	=	0;
	unsigned short	YVLen	=	0;
	
	ListDef 		Node;
	ListDef*		List;
	
	WinInfoDef*	WinInfo;			//显示字体信息
	
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	
	MaxNameList	=	sAmpLcd.Windows.ManaData.MaxNameList;
	List	=	sAmpLcd.Windows.ManaData.List;	
	
	DisplayGui();				//显示界面
	
	if(0==sAmpLcd.Windows.ManaData.ReceivedManaCount)	//无数据
	{
		goto DisplayTitleStart;
	}
	else if(0==sAmpLcd.Windows.ManaData.Serial)
	{
		sAmpLcd.Windows.ManaData.Serial	=	1;
	}
	else if(sAmpLcd.Windows.ManaData.Serial>sAmpLcd.Windows.ManaData.ReceivedManaCount)
	{
		sAmpLcd.Windows.ManaData.Serial	=	1;
	}
	//------------------------------------------设置Y起始点
	WinInfo->StartPixelY	=WinInfo->TopDisplayStartY;
	
	
	CheckDataStart:
	
	Serial=sAmpLcd.Windows.ManaData.Serial;	
	for(i=0;i<MaxNameList;i++)
	{
		if(Serial==List[i].ListNum)
		{
			Node	=	List[i];
			break;
		}		
	}
	if(i>=MaxNameList)
	{
		sAmpLcd.Windows.ManaData.Serial=1;
		return;
	}
	DisplayName(Node);			
	DisplayByName(Node);
	DisplayVender(Node);
	DisplaySpec(Node);
	DisplayCode(Node);
	DisplayNumber(Node);
	DaulFlag	=	1;
		//--------------------------------------------------
	if(WinInfo->StartPixelY>WinInfo->BotDisplayStartY)	//下半页没有足够空间显示
	{
		DisplayTitle(1);			//显示标题
		if(sAmpLcd.Windows.ManaData.Serial<sAmpLcd.Windows.ManaData.ReceivedManaCount)
		{
			sAmpLcd.Windows.ManaData.Serial+=1;
		}
		else
		{
			sAmpLcd.Windows.ManaData.Serial=1;
		}
		return;
	}
	//----------------------------------------------------还有内容待显示
	if(sAmpLcd.Windows.ManaData.Serial<sAmpLcd.Windows.ManaData.ReceivedManaCount)
	{
		sAmpLcd.Windows.ManaData.Serial+=1;
	}
	else
	{
		DisplayTitle(1);			//显示标题
		sAmpLcd.Windows.ManaData.Serial=1;		
		return;		
	}
	//=================================下半页显示
	WinInfo->StartPixelY	=	WinInfo->BotDisplayStartY;			//下半页显示
	Serial=sAmpLcd.Windows.ManaData.Serial;	
	for(i=0;i<MaxNameList;i++)
	{
		if(Serial==List[i].ListNum)
		{
			Node	=	List[i];
			break;
		}		
	}
	if(i>=MaxNameList)
	{
		sAmpLcd.Windows.ManaData.Serial=1;
		return;
	}
	
	YVLen	=	GetYVLen(Node);//获取节点数据占用Y轴的点数
	if(YVLen>(WinInfo->BotDisplayStartY-WinInfo->TopDisplayStartY))
	{
		sAmpLcd.Windows.ManaData.Serial-=1;		//恢复上次成功显示序号
		DisplayTitle(1);			//显示标题
		sAmpLcd.Windows.ManaData.Serial+=1;		//恢复下次显示序号
		return;
	}
	DisplayName(Node);			
	DisplayByName(Node);
	DisplayVender(Node);
	DisplaySpec(Node);
	DisplayCode(Node);
	DisplayNumber(Node);
	
	DisplayTitle(2);			//显示标题
	DaulFlag	=	2;
	if(sAmpLcd.Windows.ManaData.ReceivedManaCount<=2)
	{
	}
	else
	{
		if(sAmpLcd.Windows.ManaData.Serial<sAmpLcd.Windows.ManaData.ReceivedManaCount)
		{
			sAmpLcd.Windows.ManaData.Serial+=1;		//下次显示序号
		}
		else
		{
			sAmpLcd.Windows.ManaData.Serial=1;		//下次显示序号
		}
	}	
	return;
	
