quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMPLCDV12.C
	DisplayTitleStart:
	DisplayTitle(0);			//显示标题
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayGui(void)
{
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;

	unsigned short BackColor;	//背景色
	
	WinInfoDef*	WinInfo;			//显示字体信息
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	//-----------------------------------------------------顶端边框
	xs	=	0;
	xe	=	WinInfo->PxyPixel.XH-1;
	ys	=	0;
	ye	=	WinInfo->PxyTopFill.YV-1;
	BackColor	=	WinInfo->FtTitle.BackColor;
	ST7789V_Fill(xs,ys,xe,ye,0x0000);	//纯黑填充
	//-----------------------------------------------------底部边框
	xs	=	0;
	xe	=	WinInfo->PxyPixel.XH-1;
	ys	=	WinInfo->PxyPixel.YV-WinInfo->PxyBotFill.YV-1;
	ye	=	WinInfo->PxyPixel.YV-1;
	BackColor	=	WinInfo->FtTitle.BackColor;
	ST7789V_Fill(xs,ys,xe,ye,0x0000);	//纯黑填充
	//-----------------------------------------------------左边边框
	xs	=	0;
	xe	=	WinInfo->PxyLeftFill.XH-1;
	ys	=	0;
	ye	=	WinInfo->PxyPixel.YV-1;
	BackColor	=	WinInfo->FtTitle.BackColor;
	ST7789V_Fill(xs,ys,xe,ye,0x0000);	//纯黑填充
	//-----------------------------------------------------右边边框
	xs	=	319-ST7789V_V;
	xe	=	319;
	ys	=	0;
	ye	=	WinInfo->PxyPixel.YV-1;
	BackColor	=	WinInfo->FtTitle.BackColor;
	ST7789V_Fill(xs,ys,xe,ye,0x0000);	//纯黑填充
	//-----------------------------------------------------清空显示区
	xs	=	WinInfo->PxyLeftFill.XH;
	xe	=	WinInfo->PxyPixel.XH;
	ys	=	WinInfo->PxyTopFill.YV;
	ye	=	WinInfo->PxyPixel.YV-WinInfo->PxyBotFill.YV-2;
	BackColor	=	sAmpLcd.Windows.WinInfo.FtDefault.BackColor;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//默认背景色填充
	
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayName(const ListDef Node)
{
	unsigned char		strLen		=	0;		//字符串长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储
	
	unsigned short xs=0;	//字体显示坐标信息
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	
	unsigned short Fxs=0;	//填充背景色坐标信息
	unsigned short Fys=0;
	unsigned short Fxe=0;
	unsigned short Fye=0;
//	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtName;
	Para		=	Node.ParaName;
	//=================================数据内容检查
	strLen		=	Para.len;
	if(0==strLen)
	{
		return;
	}
	//=================================复制数据
	offset		=	Para.Offset;
	memcpy(str,&Node.String[offset],strLen);
	//=================================准备数据
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	//=================================清除显示区域
	WinInfo->PxyFillStart.XH	=	WinInfo->PxyLeftFill.XH;
	WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY+1;
	WinInfo->PxyFillEnd.XH		=	WinInfo->PxyFillStart.XH+Para.XH;
	WinInfo->PxyFillEnd.YV		=	WinInfo->PxyFillStart.YV+Para.YV;
	xs	=	WinInfo->PxyFillStart.XH;
	ys	=	WinInfo->PxyFillStart.YV;
	xe	=	WinInfo->PxyFillEnd.XH;
	ye	=	WinInfo->PxyFillEnd.YV;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//背景色填充/擦除/清除	
	
	//=================================设定显示区域
	if(Para.YV	==	FontSize)	//单行剧中显示
	{
		unsigned short tempx=0;
		tempx	=	strLen*(FontSize/2);				//实际显示占用的点数
		tempx	=	Para.XH	-	tempx;	//剩余空闲点数
		
		WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH+tempx/2;
		WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyDisplayStart.XH+strLen*(FontSize/2);
	}
	else
	{
		WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH;
		WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyDisplayStart.XH+Para.XH;
	}
	WinInfo->PxyDisplayStart.YV		=	WinInfo->PxyFillStart.YV;
	WinInfo->PxyDisplayEnd.YV			=	WinInfo->PxyDisplayStart.YV+Para.YV;
	//=================================显示数据
	xs	=	WinInfo->PxyDisplayStart.XH;
	ys	=	WinInfo->PxyDisplayStart.YV;
	xe	=	WinInfo->PxyDisplayEnd.XH;
	ye	=	WinInfo->PxyDisplayEnd.YV;
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,strLen,str);	//带背景色限定区域显示
	//-------------------------------------准备下一项内容显示参数
	WinInfo->StartPixelY	=	WinInfo->PxyFillEnd.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayByName(const ListDef Node)
{
	unsigned char		strLen		=	0;		//字符串长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储
	unsigned char 	Fname[]	=	"别名:";
	unsigned char 	Flen	=	strlen(Fname);
	
	unsigned short xs=0;	//字体显示坐标信息
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	
	unsigned short Fxs=0;	//填充背景色坐标信息
	unsigned short Fys=0;
	unsigned short Fxe=0;
	unsigned short Fye=0;
//	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtByName;
	Para		=	Node.ParaByName;
	//=================================数据内容检查
	strLen		=	Para.len;
	if(0==strLen)
	{
		return;
	}
	//=================================复制数据"别名:"
	memcpy(str,Fname,Flen);
	offset		=	Para.Offset;
	memcpy(&str[Flen],&Node.String[offset],strLen);
	strLen	=	strLen+Flen;
	//=================================准备数据
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	//=================================清除显示区域
	WinInfo->PxyFillStart.XH	=	WinInfo->PxyLeftFill.XH;
	WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY+1;
	WinInfo->PxyFillEnd.XH		=	WinInfo->PxyFillStart.XH+Para.XH;
	WinInfo->PxyFillEnd.YV		=	WinInfo->PxyFillStart.YV+Para.YV;
	xs	=	WinInfo->PxyFillStart.XH;
	ys	=	WinInfo->PxyFillStart.YV;
	xe	=	WinInfo->PxyFillEnd.XH;
	ye	=	WinInfo->PxyFillEnd.YV;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//背景色填充/擦除/清除	
	
	//=================================设定显示区域
	WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH;
	WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyDisplayStart.XH+Para.XH;
	WinInfo->PxyDisplayStart.YV		=	WinInfo->PxyFillStart.YV;
	WinInfo->PxyDisplayEnd.YV			=	WinInfo->PxyDisplayStart.YV+Para.YV;
	//=================================显示数据
	xs	=	WinInfo->PxyDisplayStart.XH;
	ys	=	WinInfo->PxyDisplayStart.YV;
	xe	=	WinInfo->PxyDisplayEnd.XH;
	ye	=	WinInfo->PxyDisplayEnd.YV;
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,strLen,str);	//带背景色限定区域显示
	//-------------------------------------准备下一项内容显示参数
	WinInfo->StartPixelY	=	WinInfo->PxyFillEnd.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayVender(const ListDef Node)
{
	unsigned char		strLen	=	0;		//字符串长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储
	unsigned char 	Fname[]	=	"厂家:";
	unsigned char 	Flen	=	strlen(Fname);
	
	unsigned short xs=0;	//字体显示坐标信息
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	
	unsigned short Fxs=0;	//填充背景色坐标信息
	unsigned short Fys=0;
	unsigned short Fxe=0;
	unsigned short Fye=0;
//	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtVender;
	Para		=	Node.ParaVender;
	//=================================数据内容检查
	strLen		=	Para.len;
	if(0==strLen)
	{
		return;
	}
	//=================================复制数据
	memcpy(str,Fname,Flen);
	offset		=	Para.Offset;
	memcpy(&str[Flen],&Node.String[offset],strLen);
	strLen	=	strLen+Flen;
	//=================================准备数据
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	//=================================清除显示区域
	WinInfo->PxyFillStart.XH	=	WinInfo->PxyLeftFill.XH;
	WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY+1;
	WinInfo->PxyFillEnd.XH		=	WinInfo->PxyFillStart.XH+Para.XH;
	WinInfo->PxyFillEnd.YV		=	WinInfo->PxyFillStart.YV+Para.YV;
	xs	=	WinInfo->PxyFillStart.XH;
	ys	=	WinInfo->PxyFillStart.YV;
	xe	=	WinInfo->PxyFillEnd.XH;
	ye	=	WinInfo->PxyFillEnd.YV;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//背景色填充/擦除/清除	
	
	//=================================设定显示区域

	WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH;
	WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyDisplayStart.XH+Para.XH;

	WinInfo->PxyDisplayStart.YV		=	WinInfo->PxyFillStart.YV;
	WinInfo->PxyDisplayEnd.YV			=	WinInfo->PxyDisplayStart.YV+Para.YV;
	//=================================显示数据
	xs	=	WinInfo->PxyDisplayStart.XH;
	ys	=	WinInfo->PxyDisplayStart.YV;
	xe	=	WinInfo->PxyDisplayEnd.XH;
	ye	=	WinInfo->PxyDisplayEnd.YV;
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,strLen,str);	//带背景色限定区域显示
	//-------------------------------------准备下一项内容显示参数
	WinInfo->StartPixelY	=	WinInfo->PxyFillEnd.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplaySpec(const ListDef Node)
{
	unsigned char		strLen	=	0;		//字符串长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储
	unsigned char 	Fname[]	=	"规格:";
	unsigned char 	Flen		=	strlen(Fname);
	
	unsigned short xs=0;	//字体显示坐标信息
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	
	unsigned short Fxs=0;	//填充背景色坐标信息
	unsigned short Fys=0;
	unsigned short Fxe=0;
	unsigned short Fye=0;
//	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtSpec;
	Para		=	Node.ParaSpec;
	//=================================数据内容检查
	strLen		=	Para.len;
	if(0==strLen)
	{
		return;
	}
	//=================================复制数据
	memcpy(str,Fname,Flen);
	offset		=	Para.Offset;
	memcpy(&str[Flen],&Node.String[offset],strLen);
	strLen	=	strLen+Flen;
	//=================================准备数据
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	//=================================清除显示区域
	WinInfo->PxyFillStart.XH	=	WinInfo->PxyLeftFill.XH;
	WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY+1;
	WinInfo->PxyFillEnd.XH		=	WinInfo->PxyFillStart.XH+Para.XH;
	WinInfo->PxyFillEnd.YV		=	WinInfo->PxyFillStart.YV+Para.YV;
	xs	=	WinInfo->PxyFillStart.XH;
	ys	=	WinInfo->PxyFillStart.YV;
	xe	=	WinInfo->PxyFillEnd.XH;
	ye	=	WinInfo->PxyFillEnd.YV;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//背景色填充/擦除/清除	
	
	//=================================设定显示区域

	WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH;
	WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyDisplayStart.XH+Para.XH;

	WinInfo->PxyDisplayStart.YV		=	WinInfo->PxyFillStart.YV;
	WinInfo->PxyDisplayEnd.YV			=	WinInfo->PxyDisplayStart.YV+Para.YV;
	//=================================显示数据
	xs	=	WinInfo->PxyDisplayStart.XH;
	ys	=	WinInfo->PxyDisplayStart.YV;
	xe	=	WinInfo->PxyDisplayEnd.XH;
	ye	=	WinInfo->PxyDisplayEnd.YV;
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,strLen,str);	//带背景色限定区域显示
	//-------------------------------------准备下一项内容显示参数
	WinInfo->StartPixelY	=	WinInfo->PxyFillEnd.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayCode(const ListDef Node)
{
	unsigned char		strLen	=	0;		//字符串长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储
	unsigned char 	Fname[]	=	"编码:";
	unsigned char 	Flen		=	strlen(Fname);
	
	unsigned short xs=0;	//字体显示坐标信息
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	
	unsigned short Fxs=0;	//填充背景色坐标信息
	unsigned short Fys=0;
	unsigned short Fxe=0;
	unsigned short Fye=0;
//	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtCode;
	Para		=	Node.ParaCode;
	//=================================数据内容检查
	strLen		=	Para.len;
	if(0==strLen)
	{
		return;
	}
	//=================================复制数据
	memcpy(str,Fname,Flen);
	offset		=	Para.Offset;
	memcpy(&str[Flen],&Node.String[offset],strLen);
	strLen	=	strLen+Flen;
	//=================================准备数据
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	//=================================清除显示区域
	WinInfo->PxyFillStart.XH	=	WinInfo->PxyLeftFill.XH;
	WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY+1;
	WinInfo->PxyFillEnd.XH		=	WinInfo->PxyFillStart.XH+Para.XH;
	WinInfo->PxyFillEnd.YV		=	WinInfo->PxyFillStart.YV+Para.YV;
	xs	=	WinInfo->PxyFillStart.XH;
	ys	=	WinInfo->PxyFillStart.YV;
	xe	=	WinInfo->PxyFillEnd.XH;
	ye	=	WinInfo->PxyFillEnd.YV;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//背景色填充/擦除/清除	
	
	//=================================设定显示区域

	WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH;
	WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyDisplayStart.XH+Para.XH;

	WinInfo->PxyDisplayStart.YV	=	WinInfo->PxyFillStart.YV;
	WinInfo->PxyDisplayEnd.YV		=	WinInfo->PxyDisplayStart.YV+Para.YV;
	//=================================显示数据
	xs	=	WinInfo->PxyDisplayStart.XH;
	ys	=	WinInfo->PxyDisplayStart.YV;
	xe	=	WinInfo->PxyDisplayEnd.XH;
	ye	=	WinInfo->PxyDisplayEnd.YV;
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,strLen,str);	//带背景色限定区域显示
	//-------------------------------------准备下一项内容显示参数
	WinInfo->StartPixelY	=	WinInfo->PxyFillEnd.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayNumber(const ListDef Node)
{
	unsigned char		strLen	=	0;		//字符串长度
	unsigned char		numLen	=	0;		//数值长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储
	
