quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMPLCDV12.C
	unsigned short 	xs=0;		//字体显示坐标信息
	unsigned short 	ys=0;
	unsigned short 	xe=0;
	unsigned short 	ye=0;
	
	unsigned short 	Fxs=0;	//填充背景色坐标信息
	unsigned short 	Fys=0;
	unsigned short 	Fxe=0;
	unsigned short 	Fye=0;
//	
	unsigned short 	BackColor;	//背景色
	unsigned short 	PenColor;		//画笔色
	unsigned short 	FontSize;		//字体大小
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtNum;
	Para		=	Node.ParaNum;
	//=================================数据内容检查
	numLen		=	Para.len;
	if(0==numLen)
	{
		return;
	}
	//=================================复制数据
	offset		=	Para.Offset;
	memcpy(str,&Node.String[offset],numLen);
	
	Para		=	Node.ParaUnit;
	strLen	=	Para.len;	
	offset		=	Para.Offset;
	
	memcpy(&str[numLen],&Node.String[offset],strLen);
	strLen	=	strLen+numLen;
	//=================================准备数据
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	//=================================清除显示区域
	if(Node.ParaByName.YV+Node.ParaCode.YV+Node.ParaSpec.YV+Node.ParaVender.YV>=FontSize)
	{
		WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY-FontSize;
	}
	else
	{
		WinInfo->PxyFillStart.YV	=	WinInfo->StartPixelY;
	}
	WinInfo->PxyFillStart.XH	=	WinInfo->PxyLeftFill.XH+(WinInfo->PxyValid.XH	-	(Node.ParaNum.XH+Node.ParaUnit.XH));
	
	WinInfo->PxyFillEnd.XH		=	WinInfo->PxyFillStart.XH+(Node.ParaNum.XH+Node.ParaUnit.XH);
	WinInfo->PxyFillEnd.YV		=	WinInfo->PxyFillStart.YV+Para.YV;
	xs	=	WinInfo->PxyFillStart.XH;
	ys	=	WinInfo->PxyFillStart.YV;
	xe	=	WinInfo->PxyFillEnd.XH;
	ye	=	WinInfo->PxyFillEnd.YV;
	ST7789V_Fill(xs,ys,xe,ye,BackColor);	//背景色填充/擦除/清除	
	
	//=================================设定显示区域

	WinInfo->PxyDisplayStart.XH	=	WinInfo->PxyFillStart.XH;
	WinInfo->PxyDisplayEnd.XH		=	WinInfo->PxyFillEnd.XH;

	WinInfo->PxyDisplayStart.YV		=	WinInfo->PxyFillStart.YV;
	WinInfo->PxyDisplayEnd.YV			=	WinInfo->PxyFillEnd.YV;
	//=================================显示数据
	xs	=	WinInfo->PxyDisplayStart.XH;
	ys	=	WinInfo->PxyDisplayStart.YV;
	xe	=	WinInfo->PxyDisplayEnd.XH;
	ye	=	WinInfo->PxyDisplayEnd.YV;
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,strLen,str);	//带背景色限定区域显示
	//-------------------------------------准备下一项内容显示参数
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayTitle(unsigned char DualFlag)
{
	unsigned char		strLen	=	0;		//字符串长度
	unsigned char 	offset=0;
	unsigned char		str[256];		//目标符串地址---存储

	
	unsigned short xs=0;	//字体显示坐标信息
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	
	unsigned short Fxs=0;	//填充背景色坐标信息
	unsigned short Fys=0;
	unsigned short Fxe=0;
	unsigned short Fye=0;
//	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	unsigned char 	AddrLay;		//层地址
	unsigned char 	AddrSeg;		//位地址
	
	unsigned char 	page1	=	0;		//
	unsigned char 	page2	=	0;		//
	unsigned char 	total	=	0;		//
	
	WinInfoDef*	WinInfo;			//显示字体信息
	ParaDef			Para;
	FontDef			Font;
	
	//=================================初始化数据
	WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;							//显示参数信息
	Font		=	WinInfo->FtCode;
	
	BackColor	=	Font.BackColor;
	PenColor	=	Font.PenColor;
	FontSize	=	Font.Size;
	
	AddrLay	=	sAmpLcd.Sys.AddrLay;
	AddrSeg	=	sAmpLcd.Sys.AddrSeg;
	
	page1		=	sAmpLcd.Windows.ManaData.Serial;
	total		=	sAmpLcd.Windows.ManaData.ReceivedManaCount;
	
	xs	=	WinInfo->PxyLeftFill.XH;
	ys	=	WinInfo->PxyTopFill.YV;
	
	
	ST7789V_PrintfBK(xs,ys,FontSize,BackColor,PenColor,"层:%d 位:%d",AddrLay,AddrSeg);				//后边的省略号就是可变参数
	
	if(1==DualFlag)
	{
		xs	=	WinInfo->PxyPixel.XH-FontSize*4;
		ST7789V_PrintfBK(xs,ys,FontSize,BackColor,PenColor,"%0.2d/%0.2d页",page1,total);				//后边的省略号就是可变参数
	}
	else	if(2==DualFlag)
	{
		xs	=	WinInfo->PxyPixel.XH-FontSize*8;
		ST7789V_PrintfBK(xs,ys,FontSize,BackColor,PenColor,"%0.2d/%0.2d页/%0.2d/%0.2d页",page1-1,total,page1,total);				//后边的省略号就是可变参数
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short GetYVLen(const ListDef Node)
{
	unsigned short YVLen=0;	//Y占用点数
	YVLen=0;	//Y占用点数
	YVLen	+=	Node.ParaName.YV;
	YVLen	+=	Node.ParaByName.YV;
	YVLen	+=	Node.ParaSpec.YV;
	YVLen	+=	Node.ParaVender.YV;
	YVLen	+=	Node.ParaCode.YV;
	return YVLen;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SetBackColor(unsigned short BKColor)
{
//	if(sAmpLcd.Display.LcdPort.ST7789VBColor	!=	BKColor)
//	{
//		STM32_FLASH_Write(BackColorStartAddr,(unsigned short*)&BKColor,1);						//从指定地址写入指定长度的数据
//		BKColor	=	GetBackColor();
//		sAmpLcd.Display.LcdPort.ST7789VBColor=BKColor;
//	}	
//	ST7789V_Clean(BKColor);	//清除屏幕函数
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short GetBackColor(void)
{
	unsigned short BKColor;
	STM32_FLASH_Read(BackColorStartAddr,(unsigned short*)&BKColor,1);							//从指定地址开始读出指定长度的数据
	return	BKColor;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void HW_Configuration(void)
{
//	spi_def	*SPI	=	&sAmpLcd.SpiPort;
	sST7789VDef	sST7789V;
	GT32L32Def	sGT32L32;
	RS485Def		sRS485Port;   //层板接口
	SwitchDef 	sSwitch;			//拔码开关
	
	unsigned short temp;
	
	//-------------------------------------------LCD参数初始化
	sST7789V.HWPort.sBL_PORT				=	GPIOA;
	sST7789V.HWPort.sBL_Pin					=	GPIO_Pin_1;
	
	sST7789V.HWPort.sRD_PORT				=	GPIOD;
	sST7789V.HWPort.sRD_Pin					=	GPIO_Pin_2;	
	
	sST7789V.HWPort.sREST_PORT			=	GPIOA;
	sST7789V.HWPort.sREST_Pin				=	GPIO_Pin_15;
	
