quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMPLCDV12.C
			pTargetXH	=	&Node.ParaVender.XH;
			pTargetYV	=	&Node.ParaVender.YV;
		break;
		case	0x06:	//商品编码
			Line	=	2;		//名称最大可显示2行
			strLen		=	Node.ParaCode.len;			
			FontSize	=	WinInfo.FtCode.Size;		
			Node.ParaCode.XH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH-OffsetXH;
		
			pTargetXH	=	&Node.ParaCode.XH;
			pTargetYV	=	&Node.ParaCode.YV;
		break;
		case	0x07:	//数量单位
			strtype+=1;
			goto SetDataStart;
		break;
		default:goto AddNode;	//未找到类型数据
	}
	if(0==FontSize)
		return;
	//---------------------------------计算一行可以显示多少个对应的数据
	i=*pTargetXH/(FontSize/2);	//字符宽度为高度的一半
	//---------------------------------计算需要多少行才能显示完
	if(0==i)
		return;
	if(0==strLen%i)	//整数行
	{
		i	=	strLen/i;
	}
	else
	{
		i	=	strLen/i+1;
	}
	//---------------------------------检查行数有无超限,超出部分不计入显示(不显示)
	if(i>Line)
	{
		i=Line;
	}
	//---------------------------------计算Y轴需要多少点数
	*pTargetYV	=	i*FontSize;
	//---------------------------------继续检查其它项
	strtype+=1;
	if(strtype<8)
	{
		goto SetDataStart;
	}
	//---------------------------------添加数据：添加数据前比较缓存有无相同的数据，有则不添加
	AddNode:
	for(i=0;i<MaxList;i++)
	{
		if(0==memcmp((unsigned char*)&List[i].ParaName,&Node.ParaName,sizeof(ListDef)-2))	//检查数据内容(减2是因为List[i].ListNum，16字节对齐)
		{
			if(0!=List[i].ListNum)	//序号存在
				return;
		}
	}
//---------------------------------无相同数据，往空缓存内添加数据	
	for(i=0;i<MaxList;i++)
	{
		if(0==List[i].ListNum)		//缓存为空，可以拷贝数据
		{
			//List	=	List[i];
			memcpy((unsigned char*)&List[i],&Node,sizeof(ListDef));
			sAmpLcd.Windows.ManaData.ReceivedManaCount+=1;
			List[i].ListNum	=	i+1;
			break;
		}
	}	
}
/*******************************************************************************
*函数名			:	DataInitialize
*功能描述		:	数据初始化
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DataInitialize(void)
{
	unsigned	char*	addr;
	//==========================================显示参数初始化
	WinInfoDef* WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;
	//==========================================WinFont
	WinInfo->FtDefault.BackColor	=	DisplayBackColor;
	WinInfo->FtDefault.PenColor		=	DisplayFontColor;
	WinInfo->FtDefault.Size				=	DisplayFontSize;
	
	WinInfo->FtName.BackColor			=	DisplayNameBkColor;
	WinInfo->FtName.PenColor			=	DisplayNameFtColor;
	WinInfo->FtName.Size					=	DisplayNameFtSize;
	
	WinInfo->FtByName.BackColor		=	DisplayByNameBkColor;
	WinInfo->FtByName.PenColor		=	DisplayByNameFtColor;
	WinInfo->FtByName.Size				=	DisplayByNameFtSize;
	
	WinInfo->FtSpec.BackColor			=	DisplaySpecBkColor;
	WinInfo->FtSpec.PenColor			=	DisplaySpecFtColor;
	WinInfo->FtSpec.Size					=	DisplaySpecFtSize;
	
	WinInfo->FtNum.BackColor			=	DisplayNumBkColor;
	WinInfo->FtNum.PenColor				=	DisplayNumFtColor;
	WinInfo->FtNum.Size						=	DisplayNumFtSize;
	
	WinInfo->FtSeril.BackColor		=	DisplaySerialBkColor;
	WinInfo->FtSeril.PenColor			=	DisplaySerialFtColor;
	WinInfo->FtSeril.Size					=	DisplaySerialFtSize;
	
	WinInfo->FtCode.BackColor			=	DisplayCodeBkColor;
	WinInfo->FtCode.PenColor			=	DisplayCodeFtColor;
	WinInfo->FtCode.Size					=	DisplayCodeFtSize;
	
	WinInfo->FtVender.BackColor		=	DisplayVenderBkColor;
	WinInfo->FtVender.PenColor		=	DisplayVenderFtColor;
	WinInfo->FtVender.Size				=	DisplayVenderFtSize;
	
	WinInfo->FtTitle.BackColor		=	DisplayTitleBkColor;
	WinInfo->FtTitle.PenColor			=	DisplayTitleFtColor;
	WinInfo->FtTitle.Size					=	DisplayTitleSize;
	
	WinInfo->FtSepar.BackColor		=	DisplaySeparBkColor;
	WinInfo->FtSepar.Size					=	DisplaySeparWidth;
	
	//==========================================WinInfo
	//------------------------------------------整屏像素点
	WinInfo->PxyPixel.XH					=	ST7789V_V;		//水平点个数
	WinInfo->PxyPixel.YV					=	ST7789V_H;		//垂直点个数
	
	//------------------------------------------顶端垂直起始/填充点
	WinInfo->PxyTopFill.XH				=	0;
	WinInfo->PxyTopFill.YV				=	DisplayTopFillWidth;	
	//------------------------------------------底部垂直起始/填充点
	WinInfo->PxyBotFill.XH				=	0;
	WinInfo->PxyBotFill.YV				=	DisplayBotFillWidth;
	//------------------------------------------左边起始/填充点
	WinInfo->PxyLeftFill.XH				=	DisplayLeftFillWidth;
	WinInfo->PxyLeftFill.YV				=	0;
	//------------------------------------------剩余有效使用点数
	WinInfo->PxyValid.XH					=	WinInfo->PxyPixel.XH-WinInfo->PxyLeftFill.XH-1;
	WinInfo->PxyValid.YV					=	WinInfo->PxyPixel.YV-(WinInfo->PxyBotFill.YV+WinInfo->PxyTopFill.YV);
	
	WinInfo->TopDisplayStartY			=	WinInfo->PxyTopFill.YV+WinInfo->FtTitle.Size;
	WinInfo->BotDisplayStartY			=	WinInfo->TopDisplayStartY+(WinInfo->PxyValid.YV-WinInfo->FtTitle.Size)/2;
	//------------------------------------------最大可以接收商品个数
//	addr=(unsigned char*)&sAmpLcd.Windows.ManaData.MaxNameList;		//const类型
	sAmpLcd.Windows.ManaData.MaxNameList	=	DspMaxNameTypeCount;		//const类型
//	*addr	=	DspMaxNameTypeCount;
}
#endif
